# ViewCleanJoins Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewCleanJoins Property
ParameterTypeId Class See Also
---
"Wall Join Display"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewCleanJoins { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewCleanJoins As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewCleanJoins {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace